%优化模型预测铅钡玻璃风化前化学成分的比例
%PredictionBa.m
clear;
clc;
data = xlsread('D:\CUMCM2022problems\问题1.3Ba.xlsx');
S = data(:, 19);
f = [-0.308453 -0.697239 2.18863 0.166388 0.368763 1.66475 -2.59929];
A = [1 1 1 1 1 1 1; -1 -1 -1 -1 -1 -1 -1];
B = [1.05 0.85];
Aeq = [-0.308453 -0.697239 2.18863 0.166388 0.368763 1.66475 -2.59929];
lb = [0.3194 0 0 0 0.093 0 0];%x1,x2,x3的下界
ub = [0.7551 0.0792 0.0449 0.0167 0.3922 0.0634 0.0091];%x1,x2,x3的上界
for i = 1:length(S)
    Beq = S(i)-0.309336;
    x(:,i) = linprog(f, A, B, Aeq, Beq, lb, ub);
end